zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA356VLH-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA356VLH/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA366VLL-pinctrl.h with this part's differences applied
 * below (331 removed, 2 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 011ef572d22de35a
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA356VLH_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA356VLH_WRAPPER_

#include "MCXA366VLL-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_A10_P0_20
#undef ADC0_A11_P0_21
#undef ADC0_A12_P0_22
#undef ADC0_A13_P0_23
#undef ADC0_A8_P0_18
#undef ADC0_A9_P0_19
#undef ADC1_A12_P1_14
#undef ADC1_A13_P1_15
#undef ADC2_A14_P0_14
#undef ADC2_A15_P0_15
#undef ADC2_A18_P4_2
#undef ADC2_A19_P4_3
#undef ADC2_A1_P2_10
#undef ADC2_A20_P4_4
#undef ADC2_A21_P4_5
#undef ADC2_A22_P4_6
#undef ADC2_A23_P4_7
#undef ADC2_A6_P2_20
#undef ADC3_A18_P3_20
#undef ADC3_A19_P3_21
#undef ADC3_A1_P2_11
#undef ADC3_A20_P3_22
#undef ADC3_A2_P2_23
#undef ADC3_A6_P2_21
#undef CAN1_RXD_P1_0
#undef CAN1_RXD_P1_12
#undef CAN1_RXD_P1_7
#undef CAN1_RXD_P2_0
#undef CAN1_RXD_P2_15
#undef CAN1_TXD_P1_1
#undef CAN1_TXD_P1_13
#undef CAN1_TXD_P1_6
#undef CAN1_TXD_P2_1
#undef CAN1_TXD_P2_16
#undef CLKOUT_P4_2
#undef CMP0_OUT_P0_18
#undef CMP1_OUT_P0_19
#undef CMP2_IN2_P0_23
#undef CMP2_OUT_P0_20
#undef CT0_MAT0_P0_22
#undef CT0_MAT1_P0_23
#undef CT0_MAT2_P0_18
#undef CT0_MAT3_P0_19
#undef CT2_MAT0_P2_20
#undef CT2_MAT0_P3_18
#undef CT2_MAT1_P2_21
#undef CT2_MAT1_P3_19
#undef CT2_MAT2_P3_20
#undef CT2_MAT3_P2_23
#undef CT2_MAT3_P3_21
#undef CT3_MAT0_P1_14
#undef CT3_MAT1_P1_15
#undef CT3_MAT2_P2_10
#undef CT3_MAT3_P2_11
#undef CT4_MAT0_P4_2
#undef CT4_MAT1_P4_3
#undef CT4_MAT2_P4_4
#undef CT4_MAT3_P4_5
#undef CT_INP0_P0_20
#undef CT_INP10_P3_22
#undef CT_INP1_P0_21
#undef CT_INP2_P0_14
#undef CT_INP2_P0_22
#undef CT_INP3_P0_15
#undef CT_INP3_P0_23
#undef CT_INP6_P4_6
#undef CT_INP7_P4_7
#undef CT_INP8_P3_16
#undef CT_INP9_P3_17
#undef FLEXIO0_D0_P0_0
#undef FLEXIO0_D0_P0_16
#undef FLEXIO0_D10_P1_2
#undef FLEXIO0_D10_P2_2
#undef FLEXIO0_D10_P4_2
#undef FLEXIO0_D11_P1_3
#undef FLEXIO0_D11_P2_3
#undef FLEXIO0_D11_P4_3
#undef FLEXIO0_D12_P1_4
#undef FLEXIO0_D12_P2_4
#undef FLEXIO0_D12_P4_4
#undef FLEXIO0_D13_P1_5
#undef FLEXIO0_D13_P2_5
#undef FLEXIO0_D13_P4_5
#undef FLEXIO0_D14_P1_6
#undef FLEXIO0_D14_P2_6
#undef FLEXIO0_D14_P3_6
#undef FLEXIO0_D14_P4_6
#undef FLEXIO0_D15_P1_7
#undef FLEXIO0_D15_P2_7
#undef FLEXIO0_D15_P3_7
#undef FLEXIO0_D15_P4_7
#undef FLEXIO0_D16_P1_8
#undef FLEXIO0_D16_P3_8
#undef FLEXIO0_D17_P1_9
#undef FLEXIO0_D17_P3_9
#undef FLEXIO0_D18_P1_10
#undef FLEXIO0_D18_P2_10
#undef FLEXIO0_D18_P3_10
#undef FLEXIO0_D19_P1_11
#undef FLEXIO0_D19_P2_11
#undef FLEXIO0_D19_P3_11
#undef FLEXIO0_D1_P0_1
#undef FLEXIO0_D1_P0_17
#undef FLEXIO0_D20_P1_12
#undef FLEXIO0_D20_P2_12
#undef FLEXIO0_D20_P3_12
#undef FLEXIO0_D21_P1_13
#undef FLEXIO0_D21_P2_13
#undef FLEXIO0_D21_P3_13
#undef FLEXIO0_D22_P1_14
#undef FLEXIO0_D22_P3_14
#undef FLEXIO0_D23_P1_15
#undef FLEXIO0_D23_P2_15
#undef FLEXIO0_D23_P3_15
#undef FLEXIO0_D24_P2_16
#undef FLEXIO0_D24_P3_16
#undef FLEXIO0_D25_P2_17
#undef FLEXIO0_D25_P3_17
#undef FLEXIO0_D26_P3_18
#undef FLEXIO0_D27_P2_19
#undef FLEXIO0_D27_P3_19
#undef FLEXIO0_D27_P3_27
#undef FLEXIO0_D28_P2_20
#undef FLEXIO0_D28_P3_20
#undef FLEXIO0_D28_P3_28
#undef FLEXIO0_D29_P2_21
#undef FLEXIO0_D29_P3_21
#undef FLEXIO0_D29_P3_29
#undef FLEXIO0_D2_P0_18
#undef FLEXIO0_D2_P0_2
#undef FLEXIO0_D30_P1_30
#undef FLEXIO0_D30_P3_22
#undef FLEXIO0_D30_P3_30
#undef FLEXIO0_D31_P1_31
#undef FLEXIO0_D31_P2_23
#undef FLEXIO0_D31_P3_31
#undef FLEXIO0_D3_P0_19
#undef FLEXIO0_D3_P0_3
#undef FLEXIO0_D4_P0_20
#undef FLEXIO0_D5_P0_21
#undef FLEXIO0_D6_P0_14
#undef FLEXIO0_D6_P0_22
#undef FLEXIO0_D6_P0_6
#undef FLEXIO0_D7_P0_15
#undef FLEXIO0_D7_P0_23
#undef FLEXIO0_D8_P1_0
#undef FLEXIO0_D8_P2_0
#undef FLEXIO0_D8_P3_0
#undef FLEXIO0_D9_P1_1
#undef FLEXIO0_D9_P2_1
#undef FLEXIO0_D9_P3_1
#undef I3C0_PUR_P0_2
#undef I3C0_PUR_P1_11
#undef I3C0_SCL_P0_17
#undef I3C0_SCL_P1_31
#undef I3C0_SCL_P1_9
#undef I3C0_SDA_P0_16
#undef I3C0_SDA_P1_30
#undef I3C0_SDA_P1_8
#undef LCD_P0_P1_0
#undef LCD_P10_P1_12
#undef LCD_P11_P1_13
#undef LCD_P12_P1_14
#undef LCD_P13_P1_15
#undef LCD_P18_P0_14
#undef LCD_P19_P0_15
#undef LCD_P1_P1_1
#undef LCD_P20_P0_16
#undef LCD_P21_P0_17
#undef LCD_P22_P0_18
#undef LCD_P23_P0_19
#undef LCD_P24_P0_20
#undef LCD_P25_P0_21
#undef LCD_P26_P0_22
#undef LCD_P27_P0_23
#undef LCD_P2_P1_2
#undef LCD_P32_P3_0
#undef LCD_P33_P3_1
#undef LCD_P34_P3_6
#undef LCD_P35_P3_7
#undef LCD_P36_P3_8
#undef LCD_P37_P3_9
#undef LCD_P38_P3_10
#undef LCD_P39_P3_11
#undef LCD_P3_P1_3
#undef LCD_P40_P3_12
#undef LCD_P41_P3_13
#undef LCD_P42_P3_14
#undef LCD_P43_P3_15
#undef LCD_P44_P3_16
#undef LCD_P45_P3_17
#undef LCD_P46_P3_18
#undef LCD_P47_P3_19
#undef LCD_P4_P1_6
#undef LCD_P5_P1_7
#undef LCD_P6_P1_8
#undef LCD_P7_P1_9
#undef LCD_P8_P1_10
#undef LCD_P9_P1_11
#undef LCD_VLL1_P1_5
#undef LCD_VLL2_P1_4
#undef LPI2C0_SCLS_P0_18
#undef LPI2C0_SDAS_P0_19
#undef LPI2C1_SCLS_P1_14
#undef LPI2C1_SDAS_P1_15
#undef LPI2C2_HREQ_P4_6
#undef LPI2C2_SCLS_P4_5
#undef LPI2C2_SCL_P4_3
#undef LPI2C2_SDAS_P4_2
#undef LPI2C2_SDA_P4_4
#undef LPI2C3_SCL_P3_21
#undef LPI2C3_SDA_P3_20
#undef LPSPI1_PCS2_P2_20
#undef LPSPI1_PCS3_P2_21
#undef LPUART0_CTS_B_P0_23
#undef LPUART0_RTS_B_P0_22
#undef LPUART0_RXD_P0_20
#undef LPUART0_TXD_P0_21
#undef LPUART1_RTS_B_P3_22
#undef LPUART1_RXD_P3_20
#undef LPUART1_TXD_P3_21
#undef LPUART2_CTS_B_P1_15
#undef LPUART2_RTS_B_P1_14
#undef LPUART2_RXD_P2_11
#undef LPUART2_TXD_P2_10
#undef LPUART3_CTS_B_P4_6
#undef LPUART3_RTS_B_P4_7
#undef LPUART3_RXD_P4_2
#undef LPUART3_TXD_P4_5
#undef LPUART4_CTS_B_P3_17
#undef LPUART4_RTS_B_P3_16
#undef LPUART4_RXD_P3_18
#undef LPUART4_RXD_P4_4
#undef LPUART4_TXD_P3_19
#undef LPUART4_TXD_P4_3
#undef OPAMP3_INN_P2_21
#undef OPAMP3_INP_P2_20
#undef OPAMP3_OUT_P2_23
#undef P0_14
#undef P0_15
#undef P0_18
#undef P0_19
#undef P0_20
#undef P0_21
#undef P0_22
#undef P0_23
#undef P1_14
#undef P1_15
#undef P2_10
#undef P2_11
#undef P2_20
#undef P2_21
#undef P2_23
#undef P3_16
#undef P3_17
#undef P3_18
#undef P3_19
#undef P3_20
#undef P3_21
#undef P3_22
#undef P4_2
#undef P4_3
#undef P4_4
#undef P4_5
#undef P4_6
#undef P4_7
#undef PWM0_A0_P4_6
#undef PWM0_A1_P4_4
#undef PWM0_A2_P4_2
#undef PWM0_B0_P4_7
#undef PWM0_B1_P4_5
#undef PWM0_B2_P4_3
#undef PWM0_X0_P3_18
#undef PWM0_X1_P3_19
#undef PWM0_X2_P3_20
#undef PWM0_X3_P3_21
#undef PWM1_A0_P3_16
#undef PWM1_A3_P3_20
#undef PWM1_B0_P3_17
#undef PWM1_B3_P3_21
#undef PWM1_X0_P3_18
#undef PWM1_X1_P3_19
#undef PWM1_X2_P3_22
#undef SmartDMA_PIO10_P0_20
#undef SmartDMA_PIO10_P1_14
#undef SmartDMA_PIO11_P0_21
#undef SmartDMA_PIO11_P1_15
#undef SmartDMA_PIO12_P0_22
#undef SmartDMA_PIO13_P0_23
#undef SmartDMA_PIO14_P2_10
#undef SmartDMA_PIO15_P2_11
#undef SmartDMA_PIO16_P3_16
#undef SmartDMA_PIO17_P3_17
#undef SmartDMA_PIO18_P3_18
#undef SmartDMA_PIO19_P3_19
#undef SmartDMA_PIO20_P3_20
#undef SmartDMA_PIO21_P3_21
#undef SmartDMA_PIO22_P2_20
#undef SmartDMA_PIO22_P3_22
#undef SmartDMA_PIO22_P4_2
#undef SmartDMA_PIO23_P2_21
#undef SmartDMA_PIO23_P4_3
#undef SmartDMA_PIO24_P4_4
#undef SmartDMA_PIO25_P4_5
#undef SmartDMA_PIO26_P4_6
#undef SmartDMA_PIO27_P4_7
#undef SmartDMA_PIO4_P0_14
#undef SmartDMA_PIO5_P0_15
#undef SmartDMA_PIO8_P0_18
#undef SmartDMA_PIO9_P0_19
#undef TAMPER4_P3_19
#undef TAMPER5_P3_18
#undef TRIG_IN4_P2_11
#undef TRIG_IN4_P4_6
#undef TRIG_IN5_P4_7
#undef TRIG_IN8_P2_20
#undef TRIG_IN9_P2_21
#undef TRIG_OUT0_P3_20
#undef TRIG_OUT1_P3_21
#undef TRIG_OUT3_P4_5
#undef TRIG_OUT5_P2_10
#undef TRIG_OUT5_P2_23
#undef USB0_VBUS_DET_P2_12
#undef UTICK_CAP0_P0_14
#undef UTICK_CAP1_P0_15
#undef WUU0_IN13_P1_15
#undef WUU0_IN16_P4_2
#undef WUU0_IN17_P4_4
#undef WUU0_IN3_P0_19
#undef WUU0_IN4_P0_20
#undef WUU0_IN5_P0_23

/* Signals with different mux data on this part */
#undef TRIG_IN4
#define TRIG_IN4/CT_INP5_P3_9_P3_9 A15X_MUX('3',9,4)
#undef TRIG_IN5
#define TRIG_IN5/CT_INP19_P2_7_P2_7 A15X_MUX('2',7,4)

#endif /* _ZEPHYR_DTS_BINDING_MCXA356VLH_WRAPPER_ */
